#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.external.rabbit_01_psp_token_otp: Reading...
data.onepassword_item.rabbit_01_psp_token: Reading...
random_password.rtmp_password: Refreshing state... [id=none]
random_password.alicloud_password: Refreshing state... [id=none]
random_password.webserver_password: Refreshing state... [id=none]
random_password.alicloud3_password: Refreshing state... [id=none]
data.onepassword_item.rabbit_01_psp_token: Read complete after 0s [id=vaults/66qfxcmgwlhutunx6slav6fyve/items/h7fhsftvpum7r4b3rnqznz4lym]
tls_private_key.alicloud3_key: Refreshing state... [id=f63af23191753064cf32785a897bf9b0e4143c8a]
tls_private_key.webserver_key: Refreshing state... [id=81d28d3c476734c1aaf4c71b34dcb2860024d06e]
tls_private_key.rtmp_key: Refreshing state... [id=dd53b14179e8a4c84f7cad1fa6972b0b89075bec]
tls_private_key.alicloud_key: Refreshing state... [id=2715b21a5b35894000d79cf7965b18307e9258b3]
local_file.rtmp_key_file: Refreshing state... [id=34994146c8d028ca24774dd81d754c8a915cab89]
local_file.alicloud3_key_file: Refreshing state... [id=9cb4b53c3420c0fc6eb951fe0ec7cbe716a41334]
data.external.rabbit_01_psp_token_otp: Read complete after 0s [id=-]
local_file.alicloud_key_file: Refreshing state... [id=e71958442d331fe590a11c211113b6bc0c601a0f]
local_file.webserver_key_file: Refreshing state... [id=75b14ce05c6a838c5d7461fdb112b503bb8e9dc6]
proxmox_virtual_environment_file.cloud_config_alicloud3: Refreshing state... [id=local:snippets/alicloud3.cloud-config.yaml]
proxmox_virtual_environment_file.cloud_config_alicloud: Refreshing state... [id=local:snippets/alicloud.cloud-config.yaml]
proxmox_virtual_environment_file.debian_cloud_image: Refreshing state... [id=local:iso/debian-11-genericcloud-amd64.img]
proxmox_virtual_environment_file.alilinux3_cloud_image: Refreshing state... [id=local:iso/aliyun_3_x64_20G_nocloud_alibase_20220907.img]
proxmox_virtual_environment_file.cloud_config_rtmp: Refreshing state... [id=local:snippets/ubuntu-rtmp.cloud-config.yaml]
proxmox_virtual_environment_file.alilinux_cloud_image: Refreshing state... [id=local:iso/aliyun_2_1903_x64_20G_nocloud_alibase_20220525.img]
proxmox_virtual_environment_file.cloud_config: Refreshing state... [id=local:snippets/ubuntu.cloud-config.yaml]
proxmox_virtual_environment_file.ubuntu2204_cloud_image: Refreshing state... [id=local:iso/jammy-server-cloudimg-amd64.img]
proxmox_virtual_environment_file.ubuntu2004_cloud_image: Refreshing state... [id=local:iso/focal-server-cloudimg-amd64.img]
proxmox_virtual_environment_vm.alicloud[0]: Refreshing state... [id=701]
proxmox_virtual_environment_vm.webserver[1]: Refreshing state... [id=502]
proxmox_virtual_environment_vm.rtmp[0]: Refreshing state... [id=601]
proxmox_virtual_environment_vm.webserver[0]: Refreshing state... [id=501]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # local_file.alicloud3_key_file will be created
  + resource "local_file" "alicloud3_key_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "./alicloud3-ssh.key"
      + id                   = (known after apply)
    }

  # local_file.alicloud_key_file will be created
  + resource "local_file" "alicloud_key_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "./alicloud-ssh.key"
      + id                   = (known after apply)
    }

  # local_file.rtmp_key_file will be created
  + resource "local_file" "rtmp_key_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "./rtmp-ssh.key"
      + id                   = (known after apply)
    }

  # local_file.webserver_key_file will be created
  + resource "local_file" "webserver_key_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "./webserver-ssh.key"
      + id                   = (known after apply)
    }

  # proxmox_virtual_environment_file.ubuntu2204_cloud_image must be replaced
-/+ resource "proxmox_virtual_environment_file" "ubuntu2204_cloud_image" {
      ~ file_modification_date = "2023-04-01T02:57:59Z" -> (known after apply)
      ~ file_name              = "jammy-server-cloudimg-amd64.img" -> (known after apply)
      ~ file_size              = 684785664 -> (known after apply)
      ~ file_tag               = "28d10000-5f83d7e499bc0" -> (known after apply)
      ~ id                     = "local:iso/jammy-server-cloudimg-amd64.img" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ source_file {
          ~ changed   = true -> false # forces replacement
            # (3 unchanged attributes hidden)
        }
    }

  # proxmox_virtual_environment_vm.alicloud[0] will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "alicloud" {
        id                      = "701"
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
        name                    = "alicloud1.ddlns.net"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = true -> false
      ~ tags                    = [
          - "alicloud1",
            "automation",
            "ubuntu",
          + "alicloud1",
        ]
        # (17 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.rtmp[0] will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "rtmp" {
        id                      = "601"
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "10.10.20.20",
            ],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "fe80::60f1:59ff:fe86:4ecc",
            ],
        ] -> (known after apply)
        name                    = "rtmp1.ddlns.net"
      ~ network_interface_names = [
          - "lo",
          - "eth0",
        ] -> (known after apply)
      ~ tags                    = [
            "automation",
          - "rtmp1",
            "ubuntu",
          + "rtmp1",
        ]
        # (18 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.webserver[0] will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "webserver" {
        id                      = "501"
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "10.10.20.129",
            ],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "fe80::d823:cff:fec5:9eb5",
            ],
        ] -> (known after apply)
        name                    = "web1.ddlns.net"
      ~ network_interface_names = [
          - "lo",
          - "eth0",
        ] -> (known after apply)
        tags                    = [
            "automation",
            "ubuntu",
            "web1",
        ]
        # (18 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.webserver[1] will be destroyed
  # (because index [1] is out of range for count)
  - resource "proxmox_virtual_environment_vm" "webserver" {
      - acpi                    = true -> null
      - bios                    = "seabios" -> null
      - description             = "Web2 Server" -> null
      - id                      = "502" -> null
      - ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "10.10.20.165",
            ],
        ] -> null
      - ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "fe80::2cb7:25ff:fe17:862e",
            ],
        ] -> null
      - keyboard_layout         = "en-us" -> null
      - mac_addresses           = [
          - "00:00:00:00:00:00",
          - "2E:B7:25:17:86:2E",
        ] -> null
      - name                    = "web2.ddlns.net" -> null
      - network_interface_names = [
          - "lo",
          - "eth0",
        ] -> null
      - node_name               = "rabbit-01-psp" -> null
      - on_boot                 = true -> null
      - reboot                  = false -> null
      - started                 = true -> null
      - tablet_device           = true -> null
      - tags                    = [
          - "automation",
          - "ubuntu",
          - "web2",
        ] -> null
      - template                = false -> null
      - timeout_clone           = 1800 -> null
      - timeout_move_disk       = 1800 -> null
      - timeout_reboot          = 1800 -> null
      - timeout_shutdown_vm     = 1800 -> null
      - timeout_start_vm        = 1800 -> null
      - timeout_stop_vm         = 300 -> null
      - vm_id                   = 502 -> null

      - agent {
          - enabled = true -> null
          - timeout = "15m" -> null
          - trim    = false -> null
          - type    = "virtio" -> null
        }

      - cpu {
          - architecture = "x86_64" -> null
          - cores        = 4 -> null
          - flags        = [] -> null
          - hotplugged   = 0 -> null
          - sockets      = 1 -> null
          - type         = "qemu64" -> null
          - units        = 1024 -> null
        }

      - disk {
          - datastore_id = "data-ssd" -> null
          - file_format  = "qcow2" -> null
          - file_id      = "local:iso/jammy-server-cloudimg-amd64.img" -> null
          - interface    = "virtio0" -> null
          - iothread     = true -> null
          - size         = 10 -> null
          - ssd          = false -> null
        }
      - disk {
          - datastore_id = "data-ssd" -> null
          - file_format  = "qcow2" -> null
          - interface    = "virtio1" -> null
          - iothread     = true -> null
          - size         = 30 -> null
          - ssd          = false -> null
        }

      - initialization {
          - datastore_id      = "data-ssd" -> null
          - user_data_file_id = "local:snippets/ubuntu.cloud-config.yaml" -> null

          - ip_config {
              - ipv4 {
                  - address = "dhcp" -> null
                }
            }

          - user_account {
              - keys     = [
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDs7cUrDeSpk6gIsqD2gJUFu/fzvqi3a3Ymv3ICqz26k7uhPuV0acp2dl914lRUjw05fpW2MOPVSlQ21kCLCUzCtD+TvG62DbhPg15Zl0xWKmI9vih+zyxDIqh1dRljv8zOBgD2HOcLXT3N5KsqLRVXb2bS/85KRDq4PFxqdLGH4PtAr/tG9q/92Hi8USDS6qAj7OYspDgsel3qknMxBI/DPU7TZfFQjjWJRRem992M3s1JVh3Dww0HIXD6P8hozmAV1Bn4ZdXFYbG8S9fGlWnvRLfh7SLbSxBFBWHoGJkIC5DFZbEeji/8sPBp+n6+a9PgXfugyGKia/AjqyD5Mea9",
                ] -> null
              - password = (sensitive value) -> null
              - username = "ubuntu" -> null
            }
        }

      - memory {
          - dedicated = 4096 -> null
          - floating  = 0 -> null
          - shared    = 0 -> null
        }

      - network_device {
          - bridge      = "vmbr1" -> null
          - enabled     = true -> null
          - mac_address = "2E:B7:25:17:86:2E" -> null
          - model       = "virtio" -> null
          - mtu         = 0 -> null
          - rate_limit  = 0 -> null
          - vlan_id     = 0 -> null
        }

      - operating_system {
          - type = "l26" -> null
        }

      - serial_device {
          - device = "socket" -> null
        }
    }

Plan: 5 to add, 3 to change, 2 to destroy.

Changes to Outputs:
  ~ alicloud3_image_id    = "local:iso/jammy-server-cloudimg-amd64.img" -> (known after apply)
  ~ alicloud_image_id     = "local:iso/jammy-server-cloudimg-amd64.img" -> (known after apply)
  ~ rtmp_image_id         = "local:iso/jammy-server-cloudimg-amd64.img" -> (known after apply)
  ~ rtmp_ip               = [
      - "10.10.20.20",
    ] -> (known after apply)
  ~ webserver_image_id    = "local:iso/jammy-server-cloudimg-amd64.img" -> (known after apply)
  ~ webserver_ip          = [
      - "10.10.20.129",
    ] -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @dark-vex, Action: `pull_request`, Working Directory: ``, Workflow: `TF Plan on a PR (PSP)`*